** Application Key Rotation

By default, the CDK package has some hard coded keys. This is fine for
local testing, but if you run on sepolia, you're likely to get your
funds stolen even if it's inadvertent. First, let's create a new
mnemonic seed phrase to derive our application keys.

#+begin_src bash :exports both verbatim :results output example
cast wallet new-mnemonic
#+end_src

#+RESULTS:
#+begin_example
Successfully generated a new mnemonic.
Phrase:
multiply smoke dash galaxy priority speak sell decade diamond crew charge because

Accounts:
- Account 0:
Address:     0x3C3Ade761F53bdf4F3f40B46D0AbDA286C2aCDcC
Private key: 0x8a4758bf2a9c144e4421327f6155f52e31c12ed4684e6c852b91a7d7f7e6c75f
#+end_example

Great! Now we have a new seed phrase to use. Now, we'll take that seed
phrase and write generate the settings for ~params.yml~.


#+begin_src bash :exports both verbatim :results output example
seed="multiply smoke dash galaxy priority speak sell decade diamond crew charge because"
polycli wallet inspect --mnemonic "$seed" --addresses 9 | \
    jq -r '.Addresses[] | [.ETHAddress, .HexPrivateKey] | @tsv' | \
    awk 'BEGIN{split("sequencer,aggregator,claimtxmanager,timelock,admin,loadtest,agglayer,dac,proofsigner",roles,",")} {print "zkevm_l2_" roles[NR] "_address: \"" $1 "\""; print "zkevm_l2_" roles[NR] "_private_key: \"0x" $2 "\"\n"}'
#+end_src

#+RESULTS:
#+begin_example
zkevm_l2_sequencer_address: "0x47eAFc647e0EE13F920fdF03F1DB012173452F96" 
zkevm_l2_sequencer_private_key: "a79cd51949914b6fa6a49f65669c7b9b81ff231a4320b49b3ce3218ed1cdb656" 

zkevm_l2_aggregator_address: "0x2F24237B5a1635eb708e1945ff299c08f2728399"
zkevm_l2_aggregator_private_key: "77057cbeefd49d81edb539850f23dcf62001e7150c0078364820efb13153df52"

zkevm_l2_claimtxmanager_address: "0x07c394df412978586fD9A66bf08E3F955cf00db9"
zkevm_l2_claimtxmanager_private_key: "7ff66927e40127a400ba36e68a43385d47561c4c4b7fcda1533e39724868ff60"

zkevm_l2_timelock_address: "0x46f943D43b60e03f87e1F1959C0D313D5cBBD1C2"
zkevm_l2_timelock_private_key: "a5b838802b4367047ee63f8857b122092fbc277932919d50f7e56c3a20093941"

zkevm_l2_admin_address: "0x886380dC1C51A2482b58f48617E74e80aECf0742"
zkevm_l2_admin_private_key: "768c8a9d126ce9d2c80313736c66da90d4e911ee6cbdf7dc0749ae1be3a72d96"

zkevm_l2_loadtest_address: "0x81457240ff5b49CaF176885ED07e3E7BFbE9Fb81"
zkevm_l2_loadtest_private_key: "0xd7df6d64c569ffdfe7c56e6b34e7a2bdc7b7583db74512a9ffe26fe07faaa5de"

zkevm_l2_agglayer_address: "0x8C1b9edeB66082fFbB75Ac0D2fdcC391AA002997"
zkevm_l2_agglayer_private_key: "047b918007c2e6614f9575bd14aaa44dd7d8a1315791ebb5888fb04c3f64440c"

zkevm_l2_dac_address: "0x392Ecbb8cF99D402BD2A788D871161CC06974652"
zkevm_l2_dac_private_key: "99b3d65616a126798563d9e0dfd692d43540b9cfca4c6bdf3c3df2c263c98a3c"

zkevm_l2_proofsigner_address: "0xDE5E0Ca08F7A1CDc9651Df0865dcf47A1337830E"
zkevm_l2_proofsigner_private_key: "b5ee3080a448b95f64efb459ff3e9783f28daa1de0c4e5d07a52b48e47d92885"

#+end_example

We're going to take these generated values and place them into the
[[../params.yml]] file. Each one of these settings should already exist
and you're simply replacing the keys that are already in this file.

** L1 Configuration

Now we need to adjust the parameters for L1 specifically for
Sepolia. First, let's create a new mnemonic specifically for running
contract deployment.

#+begin_src bash :exports both verbatim :results output example
cast wallet new-mnemonic
#+end_src

#+RESULTS:
#+begin_example
Phrase:
proof slam law choose steak beach fee cousin rate soup bunker undo

Accounts:
- Account 0:
Address:     0x2eEfbBbbb4344CAa1180593EBCDFC20a60f54bae
Private key: 0xff4eacda829d92184a5f385097daf968fd0730e48a7ed4ab321f79e5154d5096
#+end_example


We'll take that mnemonic and configure ~l1_preallocated_mnemonic~ with
this value.

#+begin_src bash
yq -Y --in-place '.args.l1_preallocated_mnemonic = "proof slam law choose steak beach fee cousin rate soup bunker undo"' params.yml
#+end_src

This account is used for two things. It sends funds to the accounts
that need funds on L1 (e.g. sequencer, aggregator, admin).  This
account also does the contract deployment. Accordingly, we'll need to
send funds to this account.

There are a few other values we need to configure for L1.

#+begin_src bash
yq -Y --in-place '.args.l1_chain_id = 11155111' params.yml
yq -Y --in-place '.args.l1_funding_amount = "5ether"' params.yml
yq -Y --in-place '.args.l1_rpc_url = "https://YOUR-SEPOLIA-RPC.invalid"' params.yml
yq -Y --in-place '.args.l1_ws_url = "wss://YOUR-SEPOLIA-RPC.invalid"' params.yml
#+end_src

